/* automatically generated by rust-bindgen 0.64.0 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = " 実行環境に合った適切なハードウェアアクセラレーションモードを選択する"]
pub const VoicevoxAccelerationMode_VOICEVOX_ACCELERATION_MODE_AUTO: VoicevoxAccelerationMode = 0;
#[doc = " ハードウェアアクセラレーションモードを\"CPU\"に設定する"]
pub const VoicevoxAccelerationMode_VOICEVOX_ACCELERATION_MODE_CPU: VoicevoxAccelerationMode = 1;
#[doc = " ハードウェアアクセラレーションモードを\"GPU\"に設定する"]
pub const VoicevoxAccelerationMode_VOICEVOX_ACCELERATION_MODE_GPU: VoicevoxAccelerationMode = 2;
pub type VoicevoxAccelerationMode = i32;
#[doc = " 成功"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_OK: VoicevoxResultCode = 0;
#[doc = " open_jtalk辞書ファイルが読み込まれていない"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_NOT_LOADED_OPENJTALK_DICT_ERROR: VoicevoxResultCode =
    1;
#[doc = " modelの読み込みに失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_LOAD_MODEL_ERROR: VoicevoxResultCode = 2;
#[doc = " サポートされているデバイス情報取得に失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_GET_SUPPORTED_DEVICES_ERROR: VoicevoxResultCode = 3;
#[doc = " GPUモードがサポートされていない"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_GPU_SUPPORT_ERROR: VoicevoxResultCode = 4;
#[doc = " メタ情報読み込みに失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_LOAD_METAS_ERROR: VoicevoxResultCode = 5;
#[doc = " ステータスが初期化されていない"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_UNINITIALIZED_STATUS_ERROR: VoicevoxResultCode = 6;
#[doc = " 無効なspeaker_idが指定された"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_INVALID_SPEAKER_ID_ERROR: VoicevoxResultCode = 7;
#[doc = " 無効なmodel_indexが指定された"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_INVALID_MODEL_INDEX_ERROR: VoicevoxResultCode = 8;
#[doc = " 推論に失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_INFERENCE_ERROR: VoicevoxResultCode = 9;
#[doc = " コンテキストラベル出力に失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_EXTRACT_FULL_CONTEXT_LABEL_ERROR: VoicevoxResultCode =
    10;
#[doc = " 無効なutf8文字列が入力された"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_INVALID_UTF8_INPUT_ERROR: VoicevoxResultCode = 11;
#[doc = " aquestalk形式のテキストの解析に失敗した"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_PARSE_KANA_ERROR: VoicevoxResultCode = 12;
#[doc = " 無効なAudioQuery"]
pub const VoicevoxResultCode_VOICEVOX_RESULT_INVALID_AUDIO_QUERY_ERROR: VoicevoxResultCode = 13;
pub type VoicevoxResultCode = i32;
#[doc = " 初期化オプション"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VoicevoxInitializeOptions {
    #[doc = " ハードウェアアクセラレーションモード"]
    pub acceleration_mode: VoicevoxAccelerationMode,
    #[doc = " CPU利用数を指定\n 0を指定すると環境に合わせたCPUが利用される"]
    pub cpu_num_threads: u16,
    #[doc = " 全てのモデルを読み込む"]
    pub load_all_models: bool,
    #[doc = " open_jtalkの辞書ディレクトリ"]
    pub open_jtalk_dict_dir: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_VoicevoxInitializeOptions() {
    const UNINIT: ::std::mem::MaybeUninit<VoicevoxInitializeOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VoicevoxInitializeOptions>(),
        16usize,
        concat!("Size of: ", stringify!(VoicevoxInitializeOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<VoicevoxInitializeOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(VoicevoxInitializeOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acceleration_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxInitializeOptions),
            "::",
            stringify!(acceleration_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu_num_threads) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxInitializeOptions),
            "::",
            stringify!(cpu_num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).load_all_models) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxInitializeOptions),
            "::",
            stringify!(load_all_models)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open_jtalk_dict_dir) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxInitializeOptions),
            "::",
            stringify!(open_jtalk_dict_dir)
        )
    );
}
#[doc = " Audio query のオプション"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VoicevoxAudioQueryOptions {
    #[doc = " aquestalk形式のkanaとしてテキストを解釈する"]
    pub kana: bool,
}
#[test]
fn bindgen_test_layout_VoicevoxAudioQueryOptions() {
    const UNINIT: ::std::mem::MaybeUninit<VoicevoxAudioQueryOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VoicevoxAudioQueryOptions>(),
        1usize,
        concat!("Size of: ", stringify!(VoicevoxAudioQueryOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<VoicevoxAudioQueryOptions>(),
        1usize,
        concat!("Alignment of ", stringify!(VoicevoxAudioQueryOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kana) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxAudioQueryOptions),
            "::",
            stringify!(kana)
        )
    );
}
#[doc = " `voicevox_synthesis` のオプション"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VoicevoxSynthesisOptions {
    #[doc = " 疑問文の調整を有効にする"]
    pub enable_interrogative_upspeak: bool,
}
#[test]
fn bindgen_test_layout_VoicevoxSynthesisOptions() {
    const UNINIT: ::std::mem::MaybeUninit<VoicevoxSynthesisOptions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VoicevoxSynthesisOptions>(),
        1usize,
        concat!("Size of: ", stringify!(VoicevoxSynthesisOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<VoicevoxSynthesisOptions>(),
        1usize,
        concat!("Alignment of ", stringify!(VoicevoxSynthesisOptions))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).enable_interrogative_upspeak) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxSynthesisOptions),
            "::",
            stringify!(enable_interrogative_upspeak)
        )
    );
}
#[doc = " テキスト音声合成オプション"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VoicevoxTtsOptions {
    #[doc = " aquestalk形式のkanaとしてテキストを解釈する"]
    pub kana: bool,
    #[doc = " 疑問文の調整を有効にする"]
    pub enable_interrogative_upspeak: bool,
}
#[test]
fn bindgen_test_layout_VoicevoxTtsOptions() {
    const UNINIT: ::std::mem::MaybeUninit<VoicevoxTtsOptions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VoicevoxTtsOptions>(),
        2usize,
        concat!("Size of: ", stringify!(VoicevoxTtsOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<VoicevoxTtsOptions>(),
        1usize,
        concat!("Alignment of ", stringify!(VoicevoxTtsOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kana) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxTtsOptions),
            "::",
            stringify!(kana)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).enable_interrogative_upspeak) as usize - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(VoicevoxTtsOptions),
            "::",
            stringify!(enable_interrogative_upspeak)
        )
    );
}
extern "C" {
    pub fn voicevox_make_default_initialize_options() -> VoicevoxInitializeOptions;
}
extern "C" {
    pub fn voicevox_initialize(options: VoicevoxInitializeOptions) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_get_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn voicevox_load_model(speaker_id: u32) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_is_gpu_mode() -> bool;
}
extern "C" {
    pub fn voicevox_is_model_loaded(speaker_id: u32) -> bool;
}
extern "C" {
    pub fn voicevox_finalize();
}
extern "C" {
    pub fn voicevox_get_metas_json() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn voicevox_get_supported_devices_json() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn voicevox_predict_duration(
        length: usize,
        phoneme_vector: *mut i64,
        speaker_id: u32,
        output_predict_duration_data_length: *mut usize,
        output_predict_duration_data: *mut *mut f32,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_predict_duration_data_free(predict_duration_data: *mut f32);
}
extern "C" {
    pub fn voicevox_predict_intonation(
        length: usize,
        vowel_phoneme_vector: *mut i64,
        consonant_phoneme_vector: *mut i64,
        start_accent_vector: *mut i64,
        end_accent_vector: *mut i64,
        start_accent_phrase_vector: *mut i64,
        end_accent_phrase_vector: *mut i64,
        speaker_id: u32,
        output_predict_intonation_data_length: *mut usize,
        output_predict_intonation_data: *mut *mut f32,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_predict_intonation_data_free(predict_intonation_data: *mut f32);
}
extern "C" {
    pub fn voicevox_decode(
        length: usize,
        phoneme_size: usize,
        f0: *mut f32,
        phoneme_vector: *mut f32,
        speaker_id: u32,
        output_decode_data_length: *mut usize,
        output_decode_data: *mut *mut f32,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_decode_data_free(decode_data: *mut f32);
}
extern "C" {
    pub fn voicevox_make_default_audio_query_options() -> VoicevoxAudioQueryOptions;
}
extern "C" {
    pub fn voicevox_audio_query(
        text: *const ::std::os::raw::c_char,
        speaker_id: u32,
        options: VoicevoxAudioQueryOptions,
        output_audio_query_json: *mut *mut ::std::os::raw::c_char,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_make_default_synthesis_options() -> VoicevoxSynthesisOptions;
}
extern "C" {
    pub fn voicevox_synthesis(
        audio_query_json: *const ::std::os::raw::c_char,
        speaker_id: u32,
        options: VoicevoxSynthesisOptions,
        output_wav_length: *mut usize,
        output_wav: *mut *mut u8,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_make_default_tts_options() -> VoicevoxTtsOptions;
}
extern "C" {
    pub fn voicevox_tts(
        text: *const ::std::os::raw::c_char,
        speaker_id: u32,
        options: VoicevoxTtsOptions,
        output_wav_length: *mut usize,
        output_wav: *mut *mut u8,
    ) -> VoicevoxResultCode;
}
extern "C" {
    pub fn voicevox_audio_query_json_free(audio_query_json: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn voicevox_wav_free(wav: *mut u8);
}
extern "C" {
    pub fn voicevox_error_result_to_message(
        result_code: VoicevoxResultCode,
    ) -> *const ::std::os::raw::c_char;
}
